Repository: KrzysztofEmerling/PPZ_Project
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Ranking not available for this level yet!
pl: Ranking dla tego poziomu nie jest jeszcze dostępny!

source: Statistics not available for this level yet!
pl: Statystyki dla tego poziomu nie są jeszcze dostępne!

source: You are not logged in
pl: Nie jesteś zalogowany

source: Please enter a password.
pl: Prosze wprowadzić hasło.

source: Password must not contain spaces.
pl: Hasło nie może zawierać spacji.

source: Password has less than 8 characters.
pl: Hasło nie może mieć mniej niż 8 znaków.

source: Password cannot have more than 30 characters.
pl: Hasło nie może mieć więcej niż 30 znaków.

source: Password has no lowercase letters.
pl: Hasło nie posiada małej litery.

source: Password has no capital letters.
pl: Hasło nie posiada dużej litery.

source: Password has no digits.
pl: Hasło nie posiada cyfry.

source: Password has no special characters.
pl: Hasło nie posiada znaków specjalnych.

source: Please enter Your email.
pl: Prosze wprowadzić swój email.

source: Email cannot contain capital letters.
pl: Email nie może zawierać dużych liter.

source: Email must contain top-level domain.
pl: Email musi zawierać końcówkę domeny, np. .pl lub .com.

source: Email must have characters before '@'.
pl: Email musi mieć znaki przed znakiem '@'.

source: Email must be 100 characters or fewer.
pl: Email musi mieć 100 znaków lub mniej.

source: Email doesn't exist in database!
pl: Email nie isnieje w bazie danych!

source: Wrong password!
pl: Złe hasło!

source: Login successed!
pl: Zalogowano pomyślnie!

source: Email already exists.
pl: Email już istnieje.

source: Username already exists.
pl: Nazwa użytkownika już istnieje

source: Passwords don't match.
pl: Hasła różnią się od siebie.

source: You have to accept the terms and conditions.
pl: Musisz zaakceptować regulamin.

source: Register successed. You can log in.
pl: Zarejestrowano pomyślnie. Możesz się zalogować.

source: Register failed
pl: Rejestracja nie powiodła się

source: Logout successed
pl: Pomyślnie wylogowano

source: Input data to edit.
pl: Wprowadź dane do edycji

source: New and confirm passwords do not match.
pl: Nowe hasło i jego potwierdzenie nie są takie same.

source: You have to enter new password.
pl: Musisz wprowadź nowe hasło.

source: Entered password doesn't match your current password.
pl: Wpisane hasło nie pasuje do obecnego hasła.

source: You have to enter your old password first.
pl: Musisz wprowadzić najpierw stare hasło.

source: Enter new password before confirming.
pl: Wprowadź nowe hasło przed potwierdzeniem.

source: User does not exist.
pl: Użytkownik nie istnieje.

source: Hello
pl: Witaj

source: Log out
pl: Wyloguj

source: Language
pl: Język

source: My profile
pl: Mój profil

source: My games
pl: Moje gry

source: Statistics
pl: Statystyki

source: Username
pl: Nazwa użytkownika

source: Email
pl: Adres Email

source: Member since
pl: Dołaczył

source: Edit&nbsp;User
pl: Edytuj&nbsp;Użytkownika

source: Delete&nbsp;User
pl: Usuń&nbsp;Użytkownika

source: User Panel
pl: Panel użytkownika

source: If you don't want to change a field, leave it blank.
pl: Jeśli nie chcesz zmieniać danego pola, pozostaw je puste.

source: Old password
pl: Stare hasło

source: New password
pl: Nowe hasło

source: Confirm new passsword
pl: Potwierdź nowe hasło

source: Save Changes
pl: Zapisz zmiany

source: Game ID
pl: ID gry

source: Difficulty
pl: Poziom trudności

source: Time
pl: Czas

source: Date
pl: Data

source: If you want to start a new game, close this
pl: Jeśli chcesz zacząć nową grę zamknij tę

source: window and choose difficulty for the next one!
pl: okno i wybierz poziom trudności dla nowej gry!

source: Log in
pl: Zaloguj się

source: Sign up
pl: Zarejestruj się

source: Start new game
pl: Rozpocznij nową grę

source: Easy
pl: Łatwy

source: Intermediate
pl: Średniozaawansowany

source: Hard
pl: Trudny

source: Expert
pl: Ekspert

source: How to play?
pl: Jak grać?

source: Sudoku is a logic-based puzzle game where the goal is to fill a 9x9 grid with numbers from 1 to 9.
pl: Sudoku to gra logiczna, której celem jest wypełnienie siatki 9x9 liczbami od 1 do 9.

source: The grid is divided into 9 smaller 3x3 subgrids (regions).
pl: Siatka jest podzielona na 9 mniejszych subsiatek 3x3 (regionów).

source: The basic rules are:
pl: Podstawowe zasady są następujące:

source: Each row must contain every number from 1 to 9, with no repetition.
pl: Każdy wiersz musi zawierać każdą liczbę od 1 do 9, bez powtórzeń.

source: Each column must contain every number from 1 to 9, with no repetition.
pl: Każda kolumna musi zawierać każdą liczbę od 1 do 9, bez powtórzeń.

source: Each 3x3 subgrid must contain every number from 1 to 9, with no repetition.
pl: Każda subsiatka 3x3 musi zawierać każdą liczbę od 1 do 9, bez powtórzeń.

source: Some cells are pre-filled with numbers, and the player must use logic to fill in the remaining cells according to these rules.
pl: Niektóre komórki są wstępnie wypełnione liczbami, a gracz musi używać logiki, aby wypełnić pozostałe komórki zgodnie z tymi zasadami.

source: Please log in
pl: Zaloguj się

source: Email address
pl: Adres Email

source: Password
pl: Hasło

source: Remember me
pl: Zapamiętaj mnie

source: Don't have an account?
pl: Nie masz konta?

source: Place
pl: Miejsce

source: Create an account
pl: Stwórz konto

source: Confirm Password
pl: Potwierdź hasło

source: I accept the terms and conditions.
pl: Akceptuje regulamin.

source: Already have an account?
pl: Masz już konto?

source: Total games
pl: Łączna ilość gier

source: Total players
pl: Łączna ilość graczy

source: Total playtime
pl: Łączny czas gry

source: Your total playtime
pl: Twój łączny czas gry

source: Delete My Account
pl: Usuń moje konto
